SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-61576-C

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
	WagonShape ( DR_BR_B12_61576.s )
	Size  ( 2.76139m 4.19335m 11.512731m )
Mass ( 69.5t-uk )
WheelRadius ( 19.5in )comment (Front Bogie)

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Comment(Stiffness ( 1e7N/m 1e7N/m ))
			Comment(Damping ( 0.2e7N/m 0.2e7N/m ))
			Break ( 710kN 1220kN )
			r0 ( 10cm 0cm )
		)
		CouplingHasRigidConnection (1)
		Comment(Velocity (0.1m/s))
		Comment(CouplingUniqueType (DR_BR_8P_71000))
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Comment(Stiffness ( 1e6N/m 2e6N/m ))
			Comment(Damping ( 1e6N/m 1e6N/m ))
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	CouplingHasRigidConnection (0)
	Comment(Velocity (-0.1m/s))
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
BrakeEquipmentType( Vacuum_brake, Auxilary_reservoir )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 190kN )
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )

ORTSNumberBrakeCylinders ( 2 )
Comment ( Assume 1 x 30in vacuum cylinder with 9in stroke )
Comment ( OpenRails assumes 4.5in stroke so this is set as two cylinders )
ORTSBrakeCylinderSize ( 30in )
ORTSAuxilaryResCapacity ( 8.25ft^3 ) Comment ( Based on Phillipson 16.5ft^3 vacuum chamber for 30in x 9in vacuum cylinder )

Brakepipevolume (1.29ft^3 ) Comment (* based on length of loco plus 16 feet for bends, branches and hoses *)

MaxReleaseRate ( 2.5inHg/s ) 
Comment ( use MaxReleaseRate ( 10inHg/s ) for steam braked class V2; MaxReleaseRate ( 2.5inHg/s )for vacuum braked class V2 )

MaxApplicationRate ( 2.0inHg/s )
Comment ( use MaxApplicationRate ( 1.3inHg/s ) for steam braked class V2; MaxApplicationRate ( 2.0inHg/s )for vacuum braked class V2 )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.7m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 14.0ft 0.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 5493 )
ORTSDavis_B ( 23.24 )
ORTSDavis_C ( 5.289 )

ORTSWagonFrontalArea (99)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


 Lights ( 4
  Light (
   Comment( lamp position B   )
   Type ( 0 )
   Conditions (
    Headlight ( 4 )
    Unit ( 2 )Service( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ffffee )
     Position ( 0.73 1.43 5.285 )
     Azimuth ( 0 0 0 )
     Radius ( 0.70 )
    )
   )
  )
  Light (
   Comment( lamp position c   )
   Type ( 0 )
   Conditions (
    Headlight ( 4 )
    Unit ( 2 )Service( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ffffee )
     Position ( 0 1.43 5.285 )
     Azimuth ( 0 0 0 )
     Radius ( 0.70 )
    )
   )
  )

  Light (
   Comment( lamp position B reversed  )
   Type ( 0 )
   Conditions (
    Headlight ( 4 )
    Unit ( 4 )Service( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ccff0000 )
     Position ( 0.73 1.43 5.285 )
     Azimuth ( 0 0 0 )
     Radius ( 0.60 )
    )
   )
  )
  Light (
   Comment( lamp position C reversed  )
   Type ( 0 )
   Conditions (
    Headlight ( 4 )
    Unit ( 4 )Service( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ccff0000 )
     Position ( 0 1.43 5.285 )
     Azimuth ( 0 0 0 )
     Radius ( 0.60 )
    )
   )
  )
)
	
Comment( ******* Miscellaneous Wagon Information************ )

Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( DR_BR_B12_61576.s )
        PassengerCabinHeadPos ( 1.423 3.0 -3.5 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
 Sound (	"..\\..\\Common.Steam\\2Cylinder\\K1eng.sms" )
)

Engine ( OR-61576-C

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)
StackFX
   (
    0 4.0 3.35
    0 1 0
    0.35
   )
SafetyValvesFX
   (
    0 3.95 -2.9
    0 1 0
    0.4
   )
WhistleFX
   (
    0 3.8 -3.45
    0 1 0
    0.1
   )
DrainpipeFX
	(
	-1.5 1.258 -3.886
	-0.4 -1 -0.2
	0.15
	)
			
Injectors2FX
	(
	-1.2 0.98 -5.1
	0 -1 0
	0.25
	)
Injectors1FX
	(
	1.2 0.98 -5.1
	0 -1 0
	0.25
	)
CylindersFX
   (
    0.5 0.65 5.5
    0 0 1
    0.16
   )
CylindersFX
   (
    -0.5 0.65 5.5
    0 0 1
    0.16
   )
  )
)

Wagon ( OR-61576-C )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 39in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 51t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 206ft^3 )  
ORTSEvaporationArea ( 1559ft^2 )
ORTSSuperheatArea ( 315ft^2 )
MaxBoilerPressure ( 180psi )
MaxSteamHeatingPressure ( 50psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 2 )
CylinderStroke ( 28in ) 
CylinderDiameter ( 20in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 31ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 4t-uk )
MaxTenderWaterMass ( 37000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )

xORTSBoilerEvaporationRate ( 17 )   Comment(Set to acheive max steaming rate from report)

Comment(ORTSMaxIndicatedHorsepower ( 1240.0hp ))   

ORTSMaxSuperheatTemperature ( 250.0 )   

Comment(ORTSSuperheatCutoffPressureFactor ( 35.0 ))   Comment(Set to acheive correct steam and fuel rates - but no longer used from Jan 2022)

Comment(ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.96 ))
Comment(Kylchap)

ORTSBoilerEfficiency( 0.0 0.91  190.0 0.455 )   
Comment(From Report)

ORTSBurnRate( 0.0 10.0   12000.0 1430.0   14000.0 1725.0   18000.0 2350.0   22000.0 3110.0   26000.0 4030.0   30000.0 5270.0   31000.0 5760.0  33000.0 8640 )   
Comment(From Report)

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
ORTSBrakePipeTimeFactor ( 0.03s )
TrainPipeLeakRate ( 0.03inHg/s )


Comment ( *** Ejectors *** )
Comment (* Estimate for Davies & Metcalfe Type VB ejector *)
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.32inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 240lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 90psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakeEmergencyTimeFactor ( 5s )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
          Notch(0    0 TrainBrakesControllerReleaseStart )
          Notch(0.1  0 TrainBrakesControllerRunningStart )
          Notch(0.2  1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector ( 0 1 0.1 0.55 NumNotches ( 0 ) )


FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( B1.cvf )
HeadOut (  -1.423 3.0 -3.5 )
Sound ( "..\\..\\Common.Steam\\2Cylinder\\K1cab.sms" )
Name ( "61576 B12/3 Gresley-Holden, Class C Parcels/Perishables, Norwich Shed 32A, Ex GER S29, TE 21.97Klbf" )
Description (
"The large-boilered B12/3s would survive the longest. These were withdrawn between 1947 and 1961, with the last B12s hauling services between Norwich and Cromer, and occasional visits to Liverpool Street. From 1959, No. 61576-C became the sole surviving B12. As well as regularly hauling the Yarmouth to March parcels train, it also hauled an increasing number of rail tours. Withdrawn in September 1961, No. 61576-C has been preserved."
)
)